app/views/students/index.html.erb

SELECT "students".* FROM "students"
SELECT COUNT(*) FROM "students"
---

<%= content_for :abc if (Student.publiczeel.count + Student.privatezeel.count) >= 9%>