app/views/students/show.html.erb

SELECT "reviews".* FROM "reviews" WHERE "reviews"."student_id" = $1  [["student_id", 52]]
---
<%= render @student.reviews %>
<% @student.reviews.each do |review| %>