app/controllers/products_controller.rb

  def index
    @products = Product.all
---
SELECT "products".* FROM "products"

    def set_product
      @product = Product.find(params[:id])
---
SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 19], ["LIMIT", 1]]