app/controllers/reviews_controller.rb

SELECT "students".* FROM "students" WHERE "students"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT $2  [["id", 35], ["LIMIT", 1]]
---
  def edit
    @student = Student.find(params[:student_id])
    @review = Review.find(params[:id])

SELECT "students".* FROM "students" WHERE "students"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]
---
  def preview
    @student = Student.find(params[:student_id])