app/controllers/students_controller.rb

  def index
    @students = Student.all
    @studentspaginate = Student.paginate(:page => params[:page], :per_page => 10)
---
SELECT "students".* FROM "students"
SELECT "students".* FROM "students" LIMIT $1 OFFSET $2  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "students"

  def show
    @student = Student.friendly.find(params[:id])
---
SELECT "students".* FROM "students" WHERE "students"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def create
    @student = Student.new(student_params)
    authorize @student
    if @student.save
---
INSERT INTO "students" ("rollNo", "name", "remarks", "created_at", "updated_at", "status", "email", "slug") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def edit
    p 11111111111
    p params
    @student = Student.friendly.find(params[:id])
---
SELECT "students".* FROM "students" WHERE "students"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def update
    @student = Student.friendly.find(params[:id])
    authorize @student
    if @student.update(student_params)
---
SELECT "students".* FROM "students" WHERE "students"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
UPDATE "students" SET "name" = $1, "remarks" = $2, "updated_at" = $3 WHERE "students"."id" = $4  [["name", "eminem"], ["remarks", "salim shady"], ["updated_at", "2023-04-12 13:02:22.134462"], ["id", 52]]