app/views/products/show.html.erb

SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 19], ["LIMIT", 1]]
---
<%= render @product %>
<% @specific_product = Product.find(params[:id]) %>